Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.put_sfn_policy will be updated in-place
~ resource "aws_lambda_function" "put_sfn_policy" {
        id                             = "put_sfn_policy"
      ~ last_modified                  = "2025-03-20T04:58:28.665+0000" -> (known after apply)
      ~ source_code_hash               = "EYyQT3d0qeJENlmrUx2wwAff6gcmLLyRP8zszsxry4k=" -> "HdK/yxBRtzdOOQqvOcFwqcUteDrC3FAX0iBWoSEdNk4="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ssm_association.attach_policy_scheduled will be updated in-place
~ resource "aws_ssm_association" "attach_policy_scheduled" {
        id                               = "05d33d76-c2d0-4a2e-818c-6d81cb80eacd"
        name                             = "AttachSFNResourcePolicy"
      ~ parameters                       = {
          + "PolicyB64"            = "ewogICJWZXJzaW9uIjogIjIwMTItMTAtMTciLAogICJTdGF0ZW1lbnQiOiBbCiAgICB7CiAgICAgICJFZmZlY3QiOiAiQWxsb3ciLAogICAgICAiQWN0aW9uIjogInN0YXRlczpTdGFydEV4ZWN1dGlvbiIsCiAgICAgICJSZXNvdXJjZSI6ICJhd3Nfc2ZuX3N0YXRlX21hY2hpbmUubWFudWFsX3dvcmtmbG93LmFybiIsCiAgICAgICJQcmluY2lwYWwiOiB7CiAgICAgICAgIkFXUyI6IFsKICAgICAgICAgICJhcm46YXdzOmlhbTo6ODI1NzY1NDIyODU1OnJvbGUvc2hhcmVkc2VydmljZXNfbGFtYmRhX3JvbGUiLAogICAgICAgICAgImFybjphd3M6aWFtOjo4MjU3NjU0MjI4NTU6cm9sZS9Dcm9zc0FjY291bnRTdGFydEV4ZWN1dGlvblJvbGUiCiAgICAgICAgXQogICAgICB9CiAgICB9CiAgXQp9"
          - "PolicyJson"           = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "states:StartExecution"
                          - Effect    = "Allow"
                          - Principal = {
                              - AWS = [
                                  - "arn:aws:iam::825765422855:role/sharedservices_lambda_role",
                                  - "arn:aws:iam::825765422855:role/CrossAccountStartExecutionRole",
                                ]
                            }
                          - Resource  = "aws_sfn_state_machine.manual_workflow.arn"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
            # (2 unchanged elements hidden)
        }
        tags                             = {}
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ssm_document.attach_sfn_policy will be updated in-place
~ resource "aws_ssm_document" "attach_sfn_policy" {
      ~ content          = jsonencode(
          ~ {
              ~ mainSteps     = [
                  ~ {
                      ~ inputs = {
                          ~ Payload      = jsonencode(
                              ~ {
                                  + PolicyB64   = "{{ PolicyB64 }}"
                                  - PolicyJson  = "{{ PolicyJson }}"
                                    # (1 unchanged attribute hidden)
                                }
                            )
                            # (1 unchanged attribute hidden)
                        }
                        name   = "put_sfn_policy"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (4 unchanged attributes hidden)
            }
        )
      ~ default_version  = "10" -> (known after apply)
      ~ document_version = "10" -> (known after apply)
      ~ hash             = "3a809bb87ecd364447939003f7461b98a123104b9260bd7bc21b90ccdc55e42b" -> (known after apply)
        id               = "AttachSFNResourcePolicy"
      ~ latest_version   = "10" -> (known after apply)
        name             = "AttachSFNResourcePolicy"
      ~ parameter        = [
          - {
              - name          = "ResourceArn"
              - type          = "String"
                # (2 unchanged attributes hidden)
            },
          - {
              - name          = "PolicyJson"
              - type          = "String"
                # (2 unchanged attributes hidden)
            },
          - {
              - name          = "AutomationAssumeRole"
              - type          = "String"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
        tags             = {}
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 0 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```